[net]
# Testing
#batch=1
#subdivisions=1
# Training
batch=128
subdivisions=4
width=512
height=384
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.02
#learning_rate_min =.003
burn_in=500
max_batches = 14000
policy=sgdr

sgdr_cycle=1500
sgdr_mult=2
#steps=2000,3000,4000,5000,6000
#scales=.5,.5,.5,.5,.5

[convolutional]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=1

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[shortcut]
activation=linear
from=-3

[activation]
activation=leaky

###########

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[shortcut]
activation=linear
from=-2

[activation]
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=18
activation=linear



[yolo]
mask = 3,4,5
anchors =  13, 21,  26, 29,  27, 51,  46, 38,  51, 56,  79, 58
classes=1
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1


[route]
layers = -5

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2


[route]
layers=-16

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=linear

[shortcut]
activation=linear
from=-3

[activation]
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[shortcut]
activation=linear
from=-6

[activation]
activation=leaky

[shortcut]
activation=linear
from=-6


[activation]
activation=leaky

[convolutional]
size=1
stride=2
pad=1
filters=18
activation=linear

[yolo]
mask = 0,1,2
anchors = 13, 21,  26, 29,  27, 51,  46, 38,  51, 56,  79, 58
classes=1
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1

